import intShop from "./../img/intShop.png";
import miniGame from "./../img/miniGame.png";
import coffi from "./../img/coffi.png";
import audit from "./../img/audit.png";
import toDoList from "./../img/toDoList.png"


const projects = [
    {
        img: intShop,
        title: 'Сайт Интернет-магазин мебели',
        text1: 'Проект был реализован в рамках курсовой работы.',
        text2: 'Целью проекта является создание удобного и функционального сайта для продажи мебели онлайн.',
        text3: 'HTML-разметка: содержит структуру страниц сайта. CSS-стили: определяет внешний вид сайта. Изображения: папка с изображениями для сайта.',
        text4: 'Для разработки сайта используются следующие технологии: HTML5, CSS3.',
        link: 'https://irinatab.github.io/github.io/',
    },
    {
        img: miniGame,
        title: 'Сайт с мини-играми',
        text1: 'Проект был реализован в рамках курсовой работы.',
        text2: 'Целью проекта является создание увлекательного и функционального сайта с мини-играми для развлечения пользователей.',
        text3: 'HTML-разметка: содержит структуру страниц сайта. CSS-стили: определяет внешний вид сайта. JavaScript: отвечает за интерактивность и функциональность игр. Изображения: папка с изображениями для сайта.',
        text4: 'Для разработки сайта используются следующие технологии: HTML5, CSS3.',
        link: 'https://irinatab.github.io/2-nd-course-hw/',
    },
    {
        img: coffi,
        title: 'Сайт кофейни "Зернышко"',
        text1: 'Проект был реализован в рамках батла по верстке.',
        text2: 'Целью проекта является создание удобного и функционального сайта для продажи кофе, десертов и закусок онлайн.',
        text3: 'HTML-разметка: содержит структуру страниц сайта. CSS-стили: определяет внешний вид сайта. JavaScript: отвечает за интерактивность и функциональность игр. Изображения: папка с изображениями для сайта.',
        text4: 'Для разработки сайта используются следующие технологии: HTML5, CSS3.',
        link: 'https://irinatab.github.io/batl/',
    },
    {
        img: audit,
        title: 'Сайт "AUDIT"',
        text1: 'Проект был реализован в рамках тестового задания.',
        text2: 'Целью проекта является создание удобного и функционального сайта для продажи услуг бухгалтерского учета и аудита.',
        text3: 'HTML-разметка: содержит структуру страниц сайта. CSS-стили: определяет внешний вид сайта. JavaScript: отвечает за интерактивность и функциональность меню для мобильной версии сайта. Изображения: папка с изображениями для сайта.',
        text4: 'Для разработки сайта используются следующие технологии: HTML5, CSS, JavaScript.',
        link: 'https://irinatab.github.io/site-intern-test/',
    },
    {
        img: toDoList,
        title: 'Сайт "МОИ ЗАДАЧИ"',
        text1: 'Проект был реализован в рамках тестового задания.',
        text2: 'Целью проекта является создание удобного и функционального сайта-ежедневника, список дел.',
        text3: 'HTML-разметка: содержит структуру страниц сайта. CSS-стили: определяет внешний вид сайта. JavaScript: отвечает за интерактивность и функциональность сайта. Изображения: папка с изображениями для сайта.',
        text4: 'Для разработки сайта используются следующие технологии: HTML5, CSS, JavaScript.',
        link: 'https://irinatab.github.io/my-todo-list/',
    },


]
export {projects}